[
  {
  "title": "Spaghetti carbonara",
  "image": "https://images.immediate.co.uk/production/volatile/sites/30/2020/08/recipe-image-legacy-id-1001491_11-2e0fa5c.jpg?quality=90",
  "description": "Discover how to make traditional spaghetti carbonara. This classic Italian pasta dish combines a silky cheese sauce with crisp pancetta and black pepper.",
  "serves": "4",
  "prep": "15 mins",
  "cook": "15 mins",
  "ingredients": "100g pancetta*50g pecorino cheese*50g parmesan*3 large eggs*350g spaghetti*50g unsalted butter*sea salt and freshly ground black pepper",
  "method": "Put a large saucepan of water on to boil.*Finely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.*Beat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.*Add 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).*Squash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.*While the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.*Leave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.*Keep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don't worry if a little water drops in the pan as well (you want this to happen) and don't throw the pasta water away yet.*Mix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.*Take the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn't scramble, and everything is coated.*Add extra pasta cooking water to keep it saucy (several tablespoons should do it). You don't want it wet, just moist. Season with a little salt, if needed.*Use a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.",
  "postedBy": "John Doe",
  "createdOn": "2024-02-04T12:00:00Z"
  },
  {
  "title": "Sticky toffee pudding",
  "image": "https://hotchocolatehits.com/wp-content/uploads/2016/12/Recipe-for-Sticky-Toffee-Pudding.jpg",
  "description": "Gorgeous, rich and delightful homemade sticky toffee pudding with homemade sticky toffee sauce and served with ice cream!",
  "serves": "7",
  "prep": "1 hour",
  "cook": "25 mins",
  "ingredients": "For the pudding:*225g whole medjool dates*175ml boiling water*1 tsp vanilla extract*175g self-raising flour*1 tsp bicarbonate of soda*2 eggs*85g butter*140g demerara sugar*2 tbsp black treacle*100ml milk*cream or custard to serve*For the toffee sauce*175g light muscovado sugar*50g butter*225ml double cream*1 tbsp black treacle",
  "method": "Stone and chop 225g medjool dates quite small, put them in a bowl, then pour over 175ml boiling water.*Leave for about 30 mins until cool and well-soaked, then mash a bit with a fork. Stir in 1 tsp vanilla extract.*Butter and flour seven mini pudding tins (each about 200ml/7fl oz) and sit them on a baking sheet. Heat oven to 180C/fan 160C/gas 4.*While the dates are soaking, make the puddings. Mix 175g self-raising flour and 1 tsp bicarbonate of soda together and beat the 2 eggs in a separate bowl.*Beat 85g softened butter and 140g demerara sugar together in a large bowl for a few mins until slightly creamy (the mixture will be grainy from the sugar). Add the eggs a little at a time, beating well between additions.*Beat in 2 tbsp black treacle then, using a large metal spoon, gently fold in one-third of the flour and bicarbonate of soda mix, then half of the 100ml milk, being careful not to overbeat. Repeat until all the flour mix and all the milk is used.*Stir the soaked dates into the pudding batter. The mix may look a little curdled at this point and will be like a soft, thick batter.*Spoon it evenly between the tins and bake for 20-25 mins, until risen and firm.*Meanwhile, put the 175g light muscovado sugar and 50g butter pieces for the sauce in a medium saucepan with half the 225ml double cream.*Bring to the boil over a medium heat, stirring all the time, until the sugar has completely dissolved.*Stir in 1 tbsp black treacle, turn up the heat slightly and let the mixture bubble away for 2-3 mins until it is a rich toffee colour, stirring occasionally to make sure it doesn't burn. Take the pan off the heat and beat in the rest of the double cream.*Remove the puddings from the oven. Leave in the tins for a few mins, then loosen them well from the sides of the tins with a small palette knife before turning them out.*You can serve them now with the sauce drizzled over, but they'll be even stickier if left for a day or two coated in the sauce. To do this, pour about half the sauce into one or two ovenproof serving dishes.*Sit the upturned puddings on the sauce, then pour the rest of the sauce over them. Cover with a loose tent of foil so that the sauce doesn't smudge (no need to chill).*When ready to serve, heat oven to 180C/fan 160C/gas 4. Warm the puddings through, still covered, for 15-20 mins or until the sauce is bubbling. Serve them on their own, or with cream or custard.",
  "postedBy": "Jane Smith",
  "createdOn": "2024-02-03T10:15:00Z"
  },
  {
  "title": "Fried calamari",
  "image": "https://www.thespruceeats.com/thmb/NVZv_VbE0kXd3l6SDemFqsIjhQQ=/750x0/filters:no_upscale():max_bytes(150000):strip_icc()/fried-calamari-2019531-hero-01-e294f265d7e84c0f89d4b5759759ffbf.jpg",
  "description": "Try making our crispy calamari and serve with an easy garlic mayo for a sharing starter or as part of a seafood feast.",
  "serves": "6",
  "prep": "15 mins",
  "cook": "10 mins",
  "ingredients": "300g baby squid*200g plain flour*2 tbsp capers*1 garlic clove*5 tbsp mayonnaise*vegetable or sunflower oil*lemon",
  "method": "Cut the squid into rings about ½cm thick. Tip the flour into a freezer bag and season well. Add the capers, then give everything a good shake to mix together. Tip the squid into the bag, then shake again until all the rings are well coated. Mix together the garlic and mayonnaise, then place in a serving bowl.*Pour some oil into a large pan until it comes about 7cm up the sides, but the pan is no more than a third full. Place over a medium heat and let the oil warm up. To test that the oil is ready, place a small piece of bread in the pan - it should sizzle when it touches the oil.*Remove a handful of squid from the flour and shake off any excess. Gently drop into the oil, then cook for about 3 mins until crisp. Remove with a slotted spoon and place on kitchen paper. Repeat with the remaining squid. Serve straight away with the mayonnaise and lemon wedges.",
  "postedBy": "Alice Brown",
  "createdOn": "2024-02-02T08:45:00Z"
  }
]